app/controllers/application_controller.rb

  def set_current_user
    if session[:user_id]
      Current.user = Usuario.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]