app/controllers/gyms_controller.rb

SELECT "gyms".* FROM "gyms"
---
  def index
    @gyms = Gym.all

INSERT INTO "gyms" ("name", "cnpj", "phone_number", "address", "registration_fee", "montlhy_fee", "site", "instagram", "facebook", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @gym = Gym.new(gym_params)

    if @gym.save

SELECT "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_gym
      @gym = Gym.find(params[:id])