app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "joao.evaristo@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-10-31 17:24:48.125084"], ["updated_at", "2022-10-31 17:24:48.125084"]]
---
    def create
        @user = User.new(user_params)
        if @user.save