app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)

    if @usuario.save
---
INSERT INTO "usuarios" ("nome", "idade", "telefone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"